In [1]:
import pandas as pd

In [5]:
df = pd.read_csv(r'C:/Users/mkrti/OneDrive/Документы/Python projects/Pandas/Data for pandas/bank_transactions_data_2.csv')

In [15]:
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 0)
pd.set_option('display.expand_frame_repr', False)

In [16]:
df.head

<bound method NDFrame.head of      TransactionID AccountID  TransactionAmount      TransactionDate TransactionType          Location DeviceID      IP Address MerchantID Channel  CustomerAge CustomerOccupation  TransactionDuration  LoginAttempts  AccountBalance PreviousTransactionDate
0         TX000001   AC00128              14.09  2023-04-11 16:29:14           Debit         San Diego  D000380  162.198.218.92       M015     ATM           70             Doctor                   81              1         5112.21     2024-11-04 08:08:08
1         TX000002   AC00455             376.24  2023-06-27 16:44:19           Debit           Houston  D000051     13.149.61.4       M052     ATM           68             Doctor                  141              1        13758.91     2024-11-04 08:09:35
2         TX000003   AC00019             126.29  2023-07-10 18:16:08           Debit              Mesa  D000235  215.97.143.157       M009  Online           19            Student                   56              1         1122.35     2024-11-04 08:07:04
3         TX000004   AC00070             184.50  2023-05-05 16:32:11           Debit           Raleigh  D000187  200.13.225.150       M002  Online           26            Student                   25              1         8569.06     2024-11-04 08:09:06
4         TX000005   AC00411              13.45  2023-10-16 17:51:24          Credit           Atlanta  D000308    65.164.3.100       M091  Online           26            Student                  198              1         7429.40     2024-11-04 08:06:39
...            ...       ...                ...                  ...             ...               ...      ...             ...        ...     ...          ...                ...                  ...            ...             ...                     ...
2507      TX002508   AC00297             856.21  2023-04-26 17:09:36          Credit  Colorado Springs  D000625    21.157.41.17       M072  Branch           33             Doctor                  109              1        12690.79     2024-11-04 08:11:29
2508      TX002509   AC00322             251.54  2023-03-22 17:36:48           Debit            Tucson  D000410  49.174.157.140       M029  Branch           48             Doctor                  177              1          254.75     2024-11-04 08:11:42
2509      TX002510   AC00095              28.63  2023-08-21 17:08:50           Debit         San Diego  D000095     58.1.27.124       M087  Branch           56            Retired                  146              1         3382.91     2024-11-04 08:08:39
2510      TX002511   AC00118             185.97  2023-02-24 16:24:46           Debit            Denver  D000634   21.190.11.223       M041  Online           23            Student                   19              1         1776.91     2024-11-04 08:12:22
2511      TX002512   AC00009             243.08  2023-02-14 16:21:23          Credit      Jacksonville  D000215   59.127.135.25       M041  Online           24            Student                   93              1          131.25     2024-11-04 08:07:49

[2512 rows x 16 columns]>

In [17]:
df.tail()

     TransactionID AccountID  TransactionAmount      TransactionDate TransactionType          Location DeviceID      IP Address MerchantID Channel  CustomerAge CustomerOccupation  TransactionDuration  LoginAttempts  AccountBalance PreviousTransactionDate
2507      TX002508   AC00297             856.21  2023-04-26 17:09:36          Credit  Colorado Springs  D000625    21.157.41.17       M072  Branch           33             Doctor                  109              1        12690.79     2024-11-04 08:11:29
2508      TX002509   AC00322             251.54  2023-03-22 17:36:48           Debit            Tucson  D000410  49.174.157.140       M029  Branch           48             Doctor                  177              1          254.75     2024-11-04 08:11:42
2509      TX002510   AC00095              28.63  2023-08-21 17:08:50           Debit         San Diego  D000095     58.1.27.124       M087  Branch           56            Retired                  146              1         3382.91     2024-11-04 08:08:39
2510      TX002511   AC00118             185.97  2023-02-24 16:24:46           Debit            Denver  D000634   21.190.11.223       M041  Online           23            Student                   19              1         1776.91     2024-11-04 08:12:22
2511      TX002512   AC00009             243.08  2023-02-14 16:21:23          Credit      Jacksonville  D000215   59.127.135.25       M041  Online           24            Student                   93              1          131.25     2024-11-04 08:07:49

In [19]:
df.shape

(2512, 16)

In [24]:
df.sample(5)

     TransactionID AccountID  TransactionAmount      TransactionDate TransactionType      Location DeviceID       IP Address MerchantID Channel  CustomerAge CustomerOccupation  TransactionDuration  LoginAttempts  AccountBalance PreviousTransactionDate
646       TX000647   AC00056              56.89  2023-02-03 18:03:56          Credit       Houston  D000120   31.127.129.152       M062  Branch           59           Engineer                   56              1         3034.67     2024-11-04 08:09:52
979       TX000980   AC00147              67.15  2023-11-20 17:17:05           Debit  Indianapolis  D000661    191.91.45.159       M001  Online           59             Doctor                   14              1         9028.49     2024-11-04 08:10:53
1325      TX001326   AC00020             359.65  2023-01-12 17:58:56          Credit  Jacksonville  D000133      45.64.74.86       M085  Online           25            Student                  289              1          219.53     2024-11-04 08:09:04
986       TX000987   AC00176             213.28  2023-12-25 18:29:05           Debit          Mesa  D000034  156.134.123.253       M088  Branch           51            Retired                   94              1         4835.91     2024-11-04 08:11:27
217       TX000218   AC00108             134.70  2023-08-21 16:03:18           Debit    Fort Worth  D000637     155.19.119.0       M074     ATM           50             Doctor                  106              1         8395.85     2024-11-04 08:11:07

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 16 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   TransactionID            2512 non-null   object
 1   AccountID                2512 non-null   object
 2   TransactionAmount        2512 non-null   float64
 3   TransactionDate          2512 non-null   object
 4   TransactionType          2512 non-null   object
 5   Location                 2512 non-null   object
 6   DeviceID                 2512 non-null   object
 7   IP Address               2512 non-null   object
 8   MerchantID               2512 non-null   object
 9   Channel                  2512 non-null   object
 10  CustomerAge              2512 non-null   int64
 11  CustomerOccupation       2512 non-null   object
 12  TransactionDuration      2512 non-null   int64
 13  LoginAttempts            2512 non-null   int64
 14  AccountBalance           2512 non-null   float64
 15  PreviousTransactionDate  2512 non-null   object
dtypes: float64(2), int64(3), object(11)
memory usage: 314.1+ KB

In [27]:
df.describe()

       TransactionAmount  CustomerAge  TransactionDuration  LoginAttempts  AccountBalance
count        2512.000000  2512.000000          2512.000000    2512.000000     2512.000000
mean          297.593778    44.673965           119.643312       1.124602     5114.302966
std           291.946243    17.792198            69.963757       0.602662     3900.942499
min             0.260000    18.000000            10.000000       1.000000      101.250000
25%            81.885000    27.000000            63.000000       1.000000     1504.370000
50%           211.140000    45.000000           112.500000       1.000000     4735.510000
75%           414.527500    59.000000           161.000000       1.000000     7678.820000
max          1919.110000    80.000000           300.000000       5.000000    14977.990000

number of instances the value appears

In [32]:
df['CustomerAge'].value_counts

<bound method IndexOpsMixin.value_counts of 0       70
1       68
2       19
3       26
4       26
        ..
2507    33
2508    48
2509    56
2510    23
2511    24
Name: CustomerAge, Length: 2512, dtype: int64>

In [33]:
df.max()

TransactionID                         TX002512
AccountID                              AC00500
TransactionAmount                      1919.11
TransactionDate            2024-01-01 18:21:50
TransactionType                          Debit
Location                            Washington
DeviceID                               D000700
IP Address                      99.205.173.118
MerchantID                                M100
Channel                                 Online
CustomerAge                                 80
CustomerOccupation                     Student
TransactionDuration                        300
LoginAttempts                                5
AccountBalance                        14977.99
PreviousTransactionDate    2024-11-04 08:12:23
dtype: object